nc: 80 
scales:
  n: [0.50, 0.25, 1024] 

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                                # 0-P1/2 (实16)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]                         # 1-P2/4 (实32)
  - [-1, 1, MobileNet_Block, [128, 32, 3, 1, 0, 0]]          # 2 (实32)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]                         # 3-P3/8 (实64)
  - [-1, 1, MobileNet_Block, [512, 88, 3, 1, 0, 0]]          # 4-P3/8 (实128)
  - [-1, 1, DSConv, [512, 3, 2]]                             # 5-P4/16 (实128)
  - [-1, 1, MobileNet_Block, [512, 240, 5, 1, 1, 1]]         # 6-P4/16 (实128)
  - [-1, 1, DSConv, [1024, 3, 2]]                            # 7-P5/32 (实256)
  - [-1, 1, MobileNet_Block, [1024, 576, 5, 1, 1, 1]]        # 8-P5/32 (实256)

head:
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                   # 10
  - [ 9, 1, DownsampleConv, []]                                  # 11
  - [[6, 9], 1, FullPAD_Tunnel, []]                              # 12     
  - [[4, 10], 1, FullPAD_Tunnel, []]                             # 13    
  - [[8, 11], 1, FullPAD_Tunnel, []]                             # 14 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                   # 15
  - [[-1, 12], 1, Concat, [1]]                                   # 16
  - [-1, 2, DSC3k2, [512, True]]                                 # 17
  - [[-1, 9], 1, FullPAD_Tunnel, []]                             # 18

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]                   # 19
  - [[-1, 13], 1, Concat, [1]]                                   # 20
  - [-1, 2, DSC3k2, [256, True]]                                 # 21
  - [10, 1, Conv, [256, 1, 1]]                                   # 22
  - [[21, 22], 1, FullPAD_Tunnel, []]                            # 23
  
  - [-1, 1, Conv, [256, 3, 2]]                                   # 24
  - [[-1, 18], 1, Concat, [1]]                                   # 25
  - [-1, 2, DSC3k2, [512, True]]                                 # 26
  - [[-1, 9], 1, FullPAD_Tunnel, []]                             # 27 

  - [26, 1, Conv, [512, 3, 2]]                                   # 28
  - [[-1, 14], 1, Concat, [1]]                                   # 29
  - [-1, 2, DSC3k2, [1024, True]]                                # 30
  - [[-1, 11], 1, FullPAD_Tunnel, []]                            # 31 
  
  - [[23, 27, 31], 1, Detect, [nc]]                              # 32