nc: 80 # number of classes
scales: 
  # [depth, width, max_channels]
  # n 尺度 width=0.25，计算通道时需乘以 0.25
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2  (16)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]    # 1-P2/4  (32)
  - [-1, 2, Shuffle_Block, [128, 1]]    # 2       (32)
  - [-1, 1, Conv, [512, 3, 2, 1, 4]]    # 3-P3/8  (128) -> 修改: 256变为512，确保缩放后是128
  - [-1, 2, Shuffle_Block, [512, 1]]    # 4       (128) -> P3特征输出
  - [-1, 1, DSConv, [512, 3, 2]]        # 5-P4/16 (128)
  - [-1, 4, Shuffle_Block, [512, 1]]    # 6       (128) -> P4特征输出
  - [-1, 1, DSConv, [1024, 3, 2]]       # 7-P5/32 (256)
  - [-1, 4, Shuffle_Block, [1024, 1]]   # 8       (256) -> P5特征输出

head:
  # 层 9 的输入来自 [4, 6, 8]，通道数 = 128 + 128 + 256 = 512
  # 此时与 HyperACE 内部默认预期的 512 完美匹配
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                    # 10
  - [ 9, 1, DownsampleConv, [512]]                                # 11 (缩放后 128)
  - [[6, 9], 1, FullPAD_Tunnel, []]                               # 12 
  - [[4, 10], 1, FullPAD_Tunnel, []]                              # 13 
  - [[8, 11], 1, FullPAD_Tunnel, []]                              # 14 
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                    # 15
  - [[-1, 12], 1, Concat, [1]]                                    # 16
  - [-1, 2, DSC3k2, [512, True]]                                  # 17 (缩放后 128)
  - [[-1, 9], 1, FullPAD_Tunnel, []]                              # 18

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]                    # 19
  - [[-1, 13], 1, Concat, [1]]                                    # 20
  - [-1, 2, DSC3k2, [256, True]]                                  # 21 (缩放后 64)
  - [10, 1, Conv, [256, 1, 1]]                                    # 22 (缩放后 64)
  - [[21, 22], 1, FullPAD_Tunnel, []]                             # 23
  
  - [-1, 1, Conv, [256, 3, 2]]                                    # 24 (缩放后 64)
  - [[-1, 18], 1, Concat, [1]]                                    # 25
  - [-1, 2, DSC3k2, [512, True]]                                  # 26 (缩放后 128)
  - [[-1, 9], 1, FullPAD_Tunnel, []]                              # 27

  - [26, 1, Conv, [512, 3, 2]]                                    # 28 (缩放后 128)
  - [[-1, 14], 1, Concat, [1]]                                    # 29
  - [-1, 2, DSC3k2, [1024, True]]                                 # 30 (缩放后 256)
  - [[-1, 11], 1, FullPAD_Tunnel, []]                             # 31
  
  - [[23, 27, 31], 1, Detect, [nc]]                               # 32